{
	"basic_info": {
		"description_header": "Başkent Üniversitesi İngilizce Mütercim ve Tercümanlık Bölümü'nde okuyan dilbilim dalına odaklanmış bir 4. sınıf öğrencisiyim.",
		"description": "Başkent Üniversitesi'nin Çeviri Topluluğu Başkanı olarak görev yaptım ve bu benim liderlik becerilerimi ve dil ile ilgili faaliyetlere olan tutkumu göstermemi sağladı.\nÖğrenimim süresince, dil işleme ve bilişsel dilbilim konularında derin bir ilgi geliştirdim, bu da dilin işlenmesi ve bilişsel süreçler konusundaki anlayışımı derinleştirdi. Ayrıca, daha önceki iki yıllık mühendislik bölümü geçmişim bende bilgisayarlı dilbilim ve NLP konularında merak uyandırdı ve dil ile teknoloji arasındaki kesişimi keşfetmeme ve o alanda ilerlemek istememe öncü oldu.\nProgramlama yeteneklerimi ve yetkinliğimi daha da ilerletmek ve bu alandaki becerilerimi geliştirmek amacıyla özel bir enstitüden aldığım eğitim sonrasında PCEP, PCAP ve PCPP1-2 sertifikalarını aldım.\nŞu anda NLP öğrenmeye ve bu alanda ilerlemeye odaklanıyorum. Dilbilimde sağlam bir temele ve kendimi geliştirmekte olduğum bilgisayarlı dilbilimine ve NLP'ye olan çalışmalarıma dayanarak, yenilikçi dil teknolojilerinin gelişimine katkıda bulunmayı amaçladığımı söyleyebilirim.\nAkademik başarılarım, liderlik deneyimim ve teknik becerilerimle dil ve teknoloji arasındaki boşluğu NLP alanında kapatmayı hedefliyorum.\nDil ve teknolojinin potansiyellerini keşfetmeye yönelik bir tutkuyla öğrenmeye adanmış biri olarak, yeni zorlukları kabul etmek ve NLP alanında anlamlı bir etki yapmak için oldukça heyecanlıyım.",
		"section_name": {
			"about": "Hakkımda",
			"projects": "Projeler",
			"skills": "Beceriler",
			"experience": "Deneyim"
		}
	},
	"projects": [
		{
			"title": "Animal Shelter",
			"startDate": "2020",
			"description": "Najbardziej rozbudowana aplikacja nad którą miałam okazję pracować. Poznałam dużo technologii a mój kod by sprawdzany przez super opiekuna. Aplikacja obsługuje wszystkie procesy adopcji i pozwala na przechowywanie wszelkiej dokumentacji związanej z adopcją zwierząt ze schroniska.",
			"images": [
				"images/portfolio/animal-shelter/p1.jpg",
				"images/portfolio/animal-shelter/p2.jpg"
			],
			"url": "",
			"technologies": [
				{
					"class": "devicon-angularjs-plain",
					"name": "Angular"
				},
				{
					"class": "devicon-typescript-plain",
					"name": "TypeScript"
				},
				{
					"class": "devicon-csharp-plain",
					"name": "C#"
				}
			]
		},
		{
			"title": "Photography",
			"startDate": "2018",
			"description": "Osobisty projekt na przedmiot ze studiów. Byłam odpowiedzilna za testowanie aplikacji, która optymalizuje zdjęcia z pomocą popularnych algorytmów używanych przed edytory grafiki takie jak Pixlr czy Adobe Photoshop. Otrzymałam 5-tkę za projekt :)",
			"images": [
				"images/portfolio/photography/p1.jpg",
				"images/portfolio/photography/p2.jpg"
			],
			"url": "https://github.com",
			"technologies": [
				{
					"class": "devicon-react-original",
					"name": "React"
				},
				{
					"class": "devicon-javascript-plain",
					"name": "JavaScript"
				}
			]
		},
		{
			"title": "3D Object Viewer",
			"startDate": "2015",
			"description": "Jedna z pierwszych aplikacji nad którymi pracowałam na stażu. Musiałam przygotować front-end dla aplikacji, która pokazuje modele 3D znanych budynków. To był także mój pierwszy projekt w frameworku Angular. Dużo się nauczyłam!",
			"images": [
				"images/portfolio/adventure/p1.jpg",
				"images/portfolio/adventure/p2.jpg"
			],
			"url": "https://github.com",
			"technologies": [
				{
					"class": "devicon-angularjs-plain",
					"name": "Angular"
				},
				{
					"class": "devicon-typescript-plain",
					"name": "TypeScript"
				},
				{
					"class": "devicon-csharp-plain",
					"name": "C#"
				}
			]
		}
	],
	"experience": [
		{
			"company": "DefOpenSource",
			"title": "Front-End Developer",
			"years": "10.2019 - obecnie",
			"mainTech": ["Angular 8/9/10"],
			"technologies": [
				"REST API",
				"RxJS",
				"JavaScript",
				"Bootstrap",
				"MDBootstrap",
				"EF Core",
				"Angular Material"
			]
		},
		{
			"company": "Serros Solutions",
			"title": "Stażystka",
			"years": "01.2018 - 09.2019",
			"mainTech": ["Angular 7/8"],
			"technologies": [
				"REST API",
				"RxJS",
				"Swagger",
				"JavaScript",
				"DHTMLX Gantt"
			]
		}
	]
}
